Wann-99/my-dev-lab/src/esp32_develop/esp32-s3_camera-OV2640/managed_components/espressif__esp32-camera/driver/cam_hal.c
// Copyright 2010-2020 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <stdio.h>
#include <string.h>
#include <stdalign.h>
#include "esp_heap_caps.h"
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "ll_cam.h"
#include "cam_hal.h"

#if (ESP_IDF_VERSION_MAJOR == 3) && (ESP_IDF_VERSION_MINOR == 3)
#include "rom/ets_sys.h"
#else
#include "esp_timer.h"
#include "esp_cache.h"
#include "hal/cache_hal.h"
#include "hal/cache_ll.h"
#include "esp_idf_version.h"
#ifndef ESP_CACHE_MSYNC_FLAG_DIR_M2C
#define ESP_CACHE_MSYNC_FLAG_DIR_M2C 0
#endif
#if CONFIG_IDF_TARGET_ESP32
#include "esp32/rom/ets_sys.h"  // will be removed in idf v5.0
#elif CONFIG_IDF_TARGET_ESP32S2
#include "esp32s2/rom/ets_sys.h"
#elif CONFIG_IDF_TARGET_ESP32S3
#include "esp32s3/rom/ets_sys.h"
#endif
#endif // ESP_IDF_VERSION_MAJOR

#if CONFIG_LOG_DEFAULT_LEVEL_NONE
#define ESP_CAMERA_ETS_PRINTF(f, ...)
#else
#define ESP_CAMERA_ETS_PRINTF(f, ...) ets_printf(f, ##__VA_ARGS__)
#endif

#if CONFIG_CAMERA_TASK_STACK_SIZE
#define CAM_TASK_STACK             CONFIG_CAMERA_TASK_STACK_SIZE
#else
#define CAM_TASK_STACK             (4*1024)
#endif

static const char *TAG = "cam_hal";
static cam_obj_t *cam_obj = NULL;
#if defined(CONFIG_CAMERA_PSRAM_DMA)
#define CAMERA_PSRAM_DMA_ENABLED CONFIG_CAMERA_PSRAM_DMA
#else
#define CAMERA_PSRAM_DMA_ENABLED 0
#endif

static volatile bool g_psram_dma_mode = CAMERA_PSRAM_DMA_ENABLED;
static portMUX_TYPE g_psram_dma_lock = portMUX_INITIALIZER_UNLOCKED;

/* At top of cam_hal.c – one switch for noisy ISR prints */
#ifndef CAM_LOG_SPAM_EVERY_FRAME
#define CAM_LOG_SPAM_EVERY_FRAME 0   /* set to 1 to restore old behaviour */
#endif

/* Number of bytes copied to SRAM for SOI validation when capturing
 * directly to PSRAM. Tunable to probe more of the frame start if needed. */
#ifndef CAM_SOI_PROBE_BYTES
#define CAM_SOI_PROBE_BYTES 32
#endif
/*
 * PSRAM DMA may bypass the CPU cache. Always call esp_cache_msync() on
 * PSRAM regions that the CPU will read so cached reads see the data written
 * by DMA.
 */

static inline size_t dcache_line_size(void)
{
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 0)
    /* cache_hal_get_cache_line_size() added extra argument from IDF 5.2 */
    return cache_hal_get_cache_line_size(CACHE_LL_LEVEL_EXT_MEM, CACHE_TYPE_DATA);
#else
    /* Older releases only expose the ROM helper, all current targets
     * have a 32‑byte DCache line */
    return 32;
#endif
}

/*
 * Invalidate CPU data cache lines that cover a region in PSRAM which
 * has just been written by DMA. This guarantees subsequent CPU reads
 * fetch the fresh data from PSRAM rather than stale cache contents.
 * Both address and length are aligned to the data cache line size.
 */
static inline void cam_drop_psram_cache(void *addr, size_t len)
{
    size_t line = dcache_line_size();
    if (line == 0) {
        line = 32; /* sane fallback */
    }
    uintptr_t start = (uintptr_t)addr & ~(line - 1);
    size_t sync_len = (len + ((uintptr_t)addr - start) + line - 1) & ~(line - 1);
    esp_cache_msync((void *)start, sync_len,
                    ESP_CACHE_MSYNC_FLAG_DIR_M2C | ESP_CACHE_MSYNC_FLAG_INVALIDATE);
}

/* Throttle repeated warnings printed from tight loops / ISRs.
 *
 * counter – static DRAM/IRAM uint16_t you pass in
 * first   – literal C string shown on first hit and as prefix of summaries
 */
#if CONFIG_LOG_DEFAULT_LEVEL >= 2
#define CAM_WARN_THROTTLE(counter, first)                                  \
    do {                                                                  \
        if (++(counter) == 1) {                                           \
            ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: %s\r\n"), first);        \
        } else if ((counter) % 100 == 0) {                                \
            ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: %s - 100 additional misses\r\n"), first); \
        }                                                                 \
        if ((counter) == 10000) (counter) = 1;                            \
    } while (0)
#else
#define CAM_WARN_THROTTLE(counter, first) do { (void)(counter); } while (0)
#endif

/* JPEG markers (byte-order independent). */
static const uint8_t JPEG_SOI_MARKER[] = {0xFF, 0xD8, 0xFF}; /* SOI = FF D8 FF */
#define JPEG_SOI_MARKER_LEN (3)
static const uint8_t JPEG_EOI_BYTES[] = {0xFF, 0xD9};        /* EOI = FF D9 */
#define JPEG_EOI_MARKER_LEN (2)

/* 首场首字节偶发为 0xFE（DVP 采样对齐），其后为 D8 FF 且能解出 JFIF，视作 SOI 并纠正 */
static inline void cam_try_fix_soi_leading_fe(uint8_t *buf, size_t len)
{
    if (len >= 3 && buf[0] == 0xFE && buf[1] == 0xD8 && buf[2] == 0xFF) {
        buf[0] = 0xFF;
    }
}

/* APP0：E0 00 10 J…；49/48 为 I/H，总线上 I 常被采成 H */
static bool cam_jpeg_app0_jfif_anchor(const uint8_t *b, size_t k, size_t scan)
{
    if (k + 6 >= scan) {
        return false;
    }
    return b[k] == 0xE0 && b[k + 1] == 0 && b[k + 2] == 0x10 && b[k + 3] == 0x4a && b[k + 4] == 0x46 &&
           (b[k + 5] == 0x49 || b[k + 5] == 0x48) && b[k + 6] == 0x46;
}

/* 用 APP0/JFIF 锚点对齐残缺 SOI（含 JFHF、FF 58 FF、ff ec d8 ff 等） */
static bool cam_try_recover_jpeg_soi_prefix(uint8_t *buf, size_t *plen, size_t fb_cap)
{
    size_t len = *plen;
    if (len < 16) {
        return false;
    }
    size_t scan = len < 256 ? len : 256;

    cam_try_fix_soi_leading_fe(buf, len);

    /* FE D8 FE E0…（两个 FF 都被采成 FE，串口常见） */
    if (len >= 8 && buf[0] == 0xFE && buf[1] == 0xD8 && buf[2] == 0xFE && buf[3] == 0xE0 && buf[4] == 0 &&
        buf[5] == 0x10 && buf[6] == 0x4a) {
        buf[0] = 0xFF;
        buf[2] = 0xFF;
        return true;
    }

    /* FF [杂] D8 FE|FF E0 00 10 4A…（如 ff e4 d8 fe e0，SOI 中间多一字节） */
    if (len >= 8 && buf[0] == 0xFF && buf[1] != 0xD8 && buf[2] == 0xD8 && buf[4] == 0xE0 && buf[5] == 0 &&
        buf[6] == 0x10 && buf[7] == 0x4a && (buf[3] == 0xFE || buf[3] == 0xFF)) {
        memmove(buf + 1, buf + 2, len - 2);
        len--;
        *plen = len;
        if (len >= 4 && buf[0] == 0xFF && buf[1] == 0xD8 && buf[2] == 0xFE && buf[3] == 0xE0) {
            buf[2] = 0xFF;
        }
        return true;
    }

