Wann-99/my-dev-lab/src/esp32_develop/esp32-s3_camera-OV2640/managed_components/espressif__esp32-camera/driver/cam_hal.c
    /* 首字节即 D8…（整颗 FF SOI 丢失，串口常见 d8 ff e0 00 10 4a…） */
    if (len >= 8 && buf[0] == 0xD8 && buf[1] == 0xFF && buf[2] == 0xE0 && buf[3] == 0 && buf[4] == 0x10 && buf[5] == 0x4a) {
        if (len + 1 <= fb_cap) {
            memmove(buf + 1, buf, len);
            buf[0] = 0xFF;
            len++;
            *plen = len;
            return true;
        }
    }

    /* FF D8 FE E0（APP0 首字节错成 FE，对应串口 ff d8 fe e0…） */
    if (len >= 4 && buf[0] == 0xFF && buf[1] == 0xD8 && buf[2] == 0xFE && buf[3] == 0xE0) {
        buf[2] = 0xFF;
        return true;
    }

    /* FF xx FF E0 00 10 4A：第二字节常为 D8 被采成 58 等 */
    if (len >= 7 && buf[0] == 0xFF && buf[2] == 0xFF && buf[3] == 0xE0 && buf[4] == 0 && buf[5] == 0x10 && buf[6] == 0x4a) {
        if (buf[1] != 0xD8) {
            buf[1] = 0xD8;
        }
        return true;
    }

    /* JFIF 第三字符纠正（解码器多数仍能认 APP0） */
    for (size_t k = 0; k + 6 < scan; k++) {
        if (buf[k] != 0xE0 || buf[k + 1] != 0 || buf[k + 2] != 0x10 || buf[k + 3] != 0x4a || buf[k + 4] != 0x46 ||
            buf[k + 6] != 0x46) {
            continue;
        }
        if (buf[k + 5] == 0x48) {
            buf[k + 5] = 0x49;
        }
    }

    for (size_t k = 0; k + 6 < scan; k++) {
        if (!cam_jpeg_app0_jfif_anchor(buf, k, scan)) {
            continue;
        }
        if (k < 2) {
            continue;
        }

        /* FF D8 FE EC … E0（坏两字节，E0 在 k） */
        if (k >= 4 && buf[k - 4] == 0xFF && buf[k - 3] == 0xD8 && buf[k] == 0xE0) {
            buf[k - 2] = 0xFF;
            buf[k - 1] = 0xE0;
            if (k - 4 > 0) {
                memmove(buf, buf + (k - 4), len - (k - 4));
                len -= (k - 4);
                *plen = len;
            }
            return true;
        }

        /* FF D8 ? E0 且 ?!=FF：常见 FE / EC（E0 在 k，k>=3） */
        if (k >= 3 && buf[k] == 0xE0 && buf[k - 3] == 0xFF && buf[k - 2] == 0xD8 && buf[k - 1] != 0xFF) {
            buf[k - 1] = 0xFF;
            if (k - 3 > 0) {
                memmove(buf, buf + (k - 3), len - (k - 3));
                len -= (k - 3);
                *plen = len;
            }
            return true;
        }

        /* 已是 FF D8 FF E0… */
        if (k >= 3 && buf[k - 3] == 0xFF && buf[k - 2] == 0xD8 && buf[k - 1] == 0xFF) {
            if (k - 3 > 0) {
                memmove(buf, buf + (k - 3), len - (k - 3));
                len -= (k - 3);
                *plen = len;
            }
            return true;
        }

        if (k >= 3 && buf[k - 3] == 0xFE && buf[k - 2] == 0xD8 && buf[k - 1] == 0xFF && (k - 3) == 0) {
            buf[0] = 0xFF;
            return true;
        }

        if (buf[k - 2] == 0xD8 && buf[k - 1] == 0xFF) {
            size_t d8pos = k - 2;
            if (d8pos >= 2 && buf[d8pos - 2] == 0xFF && buf[d8pos - 1] == 0xD8) {
                continue;
            }
            if (d8pos == 1 && buf[0] == 0xFF) {
                continue;
            }
            if (d8pos == 0 && (len + 1) <= fb_cap) {
                memmove(buf + 1, buf, len);
                buf[0] = 0xFF;
                len++;
                *plen = len;
                return true;
            }
            if (d8pos > 0 && (len - d8pos + 1) <= fb_cap) {
                memmove(buf, buf + d8pos, len - d8pos);
                len -= d8pos;
                memmove(buf + 1, buf, len);
                buf[0] = 0xFF;
                len++;
                *plen = len;
                return true;
            }
        }
    }

    return false;
}

/* Compute the scan window for JPEG EOI detection in PSRAM. */
static inline size_t eoi_probe_window(size_t half, size_t frame_len)
{
    size_t w = half + (JPEG_EOI_MARKER_LEN - 1);
    return w > frame_len ? frame_len : w;
}

static int cam_verify_jpeg_soi(const uint8_t *inbuf, uint32_t length)
{
    static uint16_t warn_soi_miss_cnt = 0;
    if (length < JPEG_SOI_MARKER_LEN) {
        CAM_WARN_THROTTLE(warn_soi_miss_cnt,
                          "NO-SOI - JPEG start marker missing (len < 3b)");
        return -1;
    }

    for (uint32_t i = 0; i <= length - JPEG_SOI_MARKER_LEN; i++) {
        if (memcmp(&inbuf[i], JPEG_SOI_MARKER, JPEG_SOI_MARKER_LEN) == 0) {
            //ESP_LOGW(TAG, "SOI: %d", (int) i);
            return i;
        }
    }

    CAM_WARN_THROTTLE(warn_soi_miss_cnt,
                      "NO-SOI - JPEG start marker missing");
    return -1;
}

static int cam_verify_jpeg_eoi(const uint8_t *inbuf, uint32_t length, bool search_forward)
{
    if (length < JPEG_EOI_MARKER_LEN) {
        return -1;
    }

    if (search_forward) {
        /* Scan forward to honor the earliest marker in the buffer. This avoids
         * returning an EOI that belongs to a larger previous frame when the tail
         * of that frame still resides in PSRAM. JPEG data is pseudo random, so
         * the first marker byte appears rarely; test four positions per load to
         * reduce memory traffic. */
        const uint8_t *pat = JPEG_EOI_BYTES;
        const uint32_t A = pat[0] * 0x01010101u;
        const uint32_t ONE = 0x01010101u;
        const uint32_t HIGH = 0x80808080u;
        uint32_t i = 0;
        while (i + 4 <= length) {
            uint32_t w;
            memcpy(&w, inbuf + i, 4); /* unaligned load is allowed */
            uint32_t x = w ^ A; /* identify bytes equal to first marker byte */
            uint32_t m = (~x & (x - ONE)) & HIGH; /* mask has high bit set for candidate bytes */
            while (m) { /* handle only candidates to avoid unnecessary memcmp calls */
                unsigned off = __builtin_ctz(m) >> 3;
                uint32_t pos = i + off;
                if (pos + JPEG_EOI_MARKER_LEN <= length &&
                    memcmp(inbuf + pos, pat, JPEG_EOI_MARKER_LEN) == 0) {
                    return pos;
                }
                m &= m - 1; /* clear processed candidate */
            }
            i += 4;
        }
        for (; i + JPEG_EOI_MARKER_LEN <= length; i++) {
            if (memcmp(inbuf + i, pat, JPEG_EOI_MARKER_LEN) == 0) {
                return i;
            }
        }
        return -1;
    }

    const uint8_t *dptr = inbuf + length - JPEG_EOI_MARKER_LEN;
    while (dptr >= inbuf) {
        if (memcmp(dptr, JPEG_EOI_BYTES, JPEG_EOI_MARKER_LEN) == 0) {
            return dptr - inbuf;
        }
        if (dptr == inbuf) {
            break;
        }
        dptr--;
    }
    return -1;
}

/* 最后一个 SOS（FF DA）位置，EOI 只应出现在其后的熵编码段 */
static int cam_jpeg_last_sos_off(const uint8_t *buf, size_t length)
{
    int last = -1;
    if (length < 2) {
        return -1;
    }
    for (size_t i = 0; i + 1 < length; i++) {
        if (buf[i] == 0xFF && buf[i + 1] == 0xDA) {
            last = (int)i;
        }
    }
    return last;
}

/* 从后往前找 EOI；D9 前一字节常被采成 FE/FC/E4；优先在 SOS 之后、避免误匹配表/段前填充 */
static int cam_verify_jpeg_eoi_relaxed(uint8_t *buf, size_t length)
{
    int off = cam_verify_jpeg_eoi(buf, length, false);
    if (off >= 0) {
        return off;
    }
    if (length < 2) {
        return -1;
    }
    int sos = cam_jpeg_last_sos_off(buf, length);
    int lo = (sos >= 0) ? (sos + 2) : 0;
    for (int i = (int)length - 2; i >= lo; i--) {
        if (buf[(size_t)i + 1] != 0xD9) {
            continue;
        }
        uint8_t b = buf[i];
        if (b == 0xFF) {
            return i;
        }
        if (b == 0xFE || b == 0xFC || b == 0xE4) {
            buf[i] = 0xFF;
            return i;
        }
    }
    return -1;
}

static bool cam_get_next_frame(int * frame_pos)
{
    if(!cam_obj->frames[*frame_pos].en){
        for (int x = 0; x < cam_obj->frame_cnt; x++) {
            if (cam_obj->frames[x].en) {
                *frame_pos = x;
                return true;
            }
        }
    } else {
        return true;
    }
    return false;
}

static bool cam_start_frame(int * frame_pos)
{
    if (cam_get_next_frame(frame_pos)) {
        if(ll_cam_start(cam_obj, *frame_pos)){
            // Vsync the frame manually
            ll_cam_do_vsync(cam_obj);
            uint64_t us = (uint64_t)esp_timer_get_time();
            cam_obj->frames[*frame_pos].fb.timestamp.tv_sec = us / 1000000UL;
            cam_obj->frames[*frame_pos].fb.timestamp.tv_usec = us % 1000000UL;
            return true;
        }
    }
    return false;
}

void IRAM_ATTR ll_cam_send_event(cam_obj_t *cam, cam_event_t cam_event, BaseType_t * HPTaskAwoken)
{
    if (xQueueSendFromISR(cam->event_queue, (void *)&cam_event, HPTaskAwoken) != pdTRUE) {
        ll_cam_stop(cam);
        cam->state = CAM_STATE_IDLE;
#if CAM_LOG_SPAM_EVERY_FRAME
        ESP_DRAM_LOGD(TAG, "EV-%s-OVF", cam_event==CAM_IN_SUC_EOF_EVENT ? "EOF" : "VSYNC");
#else
        static uint16_t ovf_cnt = 0;
        CAM_WARN_THROTTLE(ovf_cnt,
                          cam_event==CAM_IN_SUC_EOF_EVENT ? "EV-EOF-OVF" : "EV-VSYNC-OVF");
#endif
    }
}

