Wann-99/my-dev-lab/src/esp32_develop/esp32-s3_camera-OV2640/managed_components/espressif__esp32-camera/driver/cam_hal.c
//Copy frame from DMA dma_buffer to frame dma_buffer
static void cam_task(void *arg)
{
    int cnt = 0;
    int frame_pos = 0;
    cam_obj->state = CAM_STATE_IDLE;
    cam_event_t cam_event = 0;

    xQueueReset(cam_obj->event_queue);

    while (1) {
        xQueueReceive(cam_obj->event_queue, (void *)&cam_event, portMAX_DELAY);
        DBG_PIN_SET(1);
        switch (cam_obj->state) {

            case CAM_STATE_IDLE: {
                if (cam_event == CAM_VSYNC_EVENT) {
                    //DBG_PIN_SET(1);
                    if(cam_start_frame(&frame_pos)){
                        cam_obj->frames[frame_pos].fb.len = 0;
                        cam_obj->state = CAM_STATE_READ_BUF;
                    }
                    cnt = 0;
                }
            }
            break;

            case CAM_STATE_READ_BUF: {
                camera_fb_t * frame_buffer_event = &cam_obj->frames[frame_pos].fb;
                size_t pixels_per_dma = (cam_obj->dma_half_buffer_size * cam_obj->fb_bytes_per_pixel) / (cam_obj->dma_bytes_per_item * cam_obj->in_bytes_per_pixel);

                if (cam_event == CAM_IN_SUC_EOF_EVENT) {
                    if(!cam_obj->psram_mode){
                        if (cam_obj->fb_size < (frame_buffer_event->len + pixels_per_dma)) {
                            ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: FB-OVF\r\n"));
                            ll_cam_stop(cam_obj);
                            continue;
                        }
                        frame_buffer_event->len += ll_cam_memcpy(cam_obj,
                            &frame_buffer_event->buf[frame_buffer_event->len],
                            &cam_obj->dma_buffer[(cnt % cam_obj->dma_half_buffer_cnt) * cam_obj->dma_half_buffer_size],
                            cam_obj->dma_half_buffer_size);
                    } else {
                        // stop if the next DMA copy would exceed the framebuffer slot
                        // size, since we're called only after the copy occurs
                        // This effectively reduces maximum usable frame buffer size
                        // by one DMA operation, as we can't predict here, if the next
                        // cam event will be a VSYNC
                        if (cnt + 1 >= cam_obj->frame_copy_cnt) {
                            ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: DMA overflow\r\n"));
                            ll_cam_stop(cam_obj);
                            cam_obj->state = CAM_STATE_IDLE;
                            continue;
                        }
                    }

                    //Check for JPEG SOI in the first buffer. stop if not found
                    if (cam_obj->jpeg_mode && cnt == 0) {
                        if (cam_obj->psram_mode) {
                            /* dma_half_buffer_size already in BYTES (see ll_cam_memcpy()) */
                            size_t probe_len = cam_obj->dma_half_buffer_size;
                            /* clamp to avoid copying past the end of soi_probe */
                            if (probe_len > CAM_SOI_PROBE_BYTES) {
                                probe_len = CAM_SOI_PROBE_BYTES;
                            }
                            /* Invalidate cache lines for the DMA buffer before probing */
                            cam_drop_psram_cache(frame_buffer_event->buf, probe_len);

                            cam_try_fix_soi_leading_fe(frame_buffer_event->buf, probe_len);
                            uint8_t soi_probe[CAM_SOI_PROBE_BYTES];
                            memcpy(soi_probe, frame_buffer_event->buf, probe_len);
                            int soi_off = cam_verify_jpeg_soi(soi_probe, probe_len);
                            if (soi_off != 0) {
                                static uint16_t warn_psram_soi_cnt = 0;
                                if (soi_off > 0) {
                                    CAM_WARN_THROTTLE(warn_psram_soi_cnt,
                                                      "NO-SOI - JPEG start marker not at pos 0 (PSRAM)");
                                } else {
                                    CAM_WARN_THROTTLE(warn_psram_soi_cnt,
                                                      "NO-SOI - JPEG start marker missing (PSRAM)");
                                }
                                ll_cam_stop(cam_obj);
                                cam_obj->state = CAM_STATE_IDLE;
                                continue;
                            }
                        } else {
                            (void)cam_try_recover_jpeg_soi_prefix(frame_buffer_event->buf, &frame_buffer_event->len,
                                                                  cam_obj->fb_size);
                            cam_try_fix_soi_leading_fe(frame_buffer_event->buf, frame_buffer_event->len);
                            int soi_off = cam_verify_jpeg_soi(frame_buffer_event->buf, frame_buffer_event->len);
                            if (soi_off < 0) {
                                static uint32_t soi_miss_diag = 0;
                                soi_miss_diag++;
                                if ((soi_miss_diag % 50u) == 1u) {
                                    size_t n = frame_buffer_event->len;
                                    if (n > 32) {
                                        n = 32;
                                    }
                                    ESP_LOGW(TAG, "SOI missing, 1st chunk %u B, miss #%lu, hex:",
                                             (unsigned)frame_buffer_event->len, (unsigned long)soi_miss_diag);
                                    ESP_LOG_BUFFER_HEXDUMP(TAG, frame_buffer_event->buf, n, ESP_LOG_WARN);
                                }
                                static uint16_t warn_soi_bad_cnt = 0;
                                CAM_WARN_THROTTLE(warn_soi_bad_cnt,
                                                  "NO-SOI - JPEG start marker missing");
                                ll_cam_stop(cam_obj);
                                cam_obj->state = CAM_STATE_IDLE;
                                continue;
                            }
                            if (soi_off > 0) {
                                size_t new_len = frame_buffer_event->len - (size_t)soi_off;
                                memmove(frame_buffer_event->buf,
                                        frame_buffer_event->buf + soi_off,
                                        new_len);
                                frame_buffer_event->len = new_len;
                            }
                        }
                    }

